Revit 2027 API
ExternalServiceRegistry.GetServices Method
 Returns a collection of all external services currently registered in Revit.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ExternalService> GetServices()
Public Shared Function GetServices As IList(Of ExternalService)
public:
static IList<ExternalService^>^ GetServices()
static member GetServices : unit -> IList<ExternalService>
Return Value
IList<ExternalService>
 Array of ExternalService instances.
See Also
Reference
ExternalServiceRegistry Class
Autodesk.Revit.DB.ExternalService Namespace